---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyCurtainWallGridLines
source: html/dfe33072-b889-e552-bab0-bb9e95b60251.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyCurtainWallGridLines Property

Curtain wall grid lines currently cannot be copied.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyCurtainWallGridLines { get; }
```